[	
	{
		"name": "Technical Support Consultant - Renison University College",
		"description": "I monitored and managed the JIRA management system where classroom and office help requests would appear. These help requests consisted of technological equipment replacement, network troubleshooting and many other personal problems that people faced with regard to technology. Furthermore, I was in charge of creating new Automation Rules and AI-generated documentation for the JIRA management system and the newer Azure-DevOps system to decrease the workload of our team. I also managed the facility's audio equipment for graduation ceremonies and other event set-ups.",
		"start_date": "September 2023",
		"end_date": "Present",
		"type": "Work Experience",
		"image": "/images/renison.png"
	},
	{
		"name": "Junior Developer - Tuq Inc",
		"description": "I worked on 6 client-based projects and maintained 3 older company projects throughout the Work Term. Each project contained 20+ models, updated with user-specific features and tested with 2500+ RSpec and rswag tests. These projects were planned with detailed database diagrams encompassing models and associations using draw.io. All projects were created with Ruby on Rails, RSpec, rswag, HTML, PostgreSQL, Linux as the OS, and GitHub for source control.",
		"start_date": "January 2023",
		"end_date": "April 2023",
		"type": "Work Experience",
		"image": "/images/tuq.png"
	},
	{
		"name": "Machine Learning & Software Engineer - Waterloo Aerial Robotics Group",
		"description": "I utilized a YoloV8 model training a drone to detect landing pads with 96% accuracy. Other tasks included creating an autonomous flight algorithm for path detections and other path calculations for unprecedented changes during a flight.\n - \nLanguages and Tools used: Python, YoloV8, Github",
		"start_date": "September 2023",
		"end_date": "Present",
		"type": "Projects",
		"image": "/images/warg.png"
	},
	{
		"name": "Lead Web Developer - Pinned",
		"description": "Led a team of 7 developers to work on developing a news platform showcasing organization's events for subscribers. These events include anything related to clubs, ceremonies, speaker talks, and much more!\n - \nLanguages and Tools used: MongoDB, Express.js, React.js, Node.js, Notion, GitHub",
		"start_date": "October 2023",
		"end_date": "Present",
		"type": "Projects",
		"image": "/images/pinned.png"
	},
	{
		"name": "Competitions Organizor - MIST TORONTO",
		"description": "I helped recruit 70+ judges, moderators, and volunteers for high-school competitions - of all categories - to take place at the University of Toronto Saint George Campus. I completed this task with 100+ members in 6 months while attending bi-weekly meetings.",
		"start_date": "September 2022",
		"end_date": "March 2023",
		"type": "Volunteer Experience",
		"image": "/images/mist_toronto.png"
	},
	{
		"name": "Mentor - Math4me",
		"description": "I worked as a Math, Science, and English mentor to middle-school and high-school students who required assistance. I achieved 'Mentor of the Month' during my first month as a result of the hard work and dedication I had put into the job. After almost 3 years of working at Math4me, I have learned how to adapt and please different mindsets while convincing people - especially youth - to do what is right for them.",
		"start_date": "November 2020",
		"end_date": "Present",
		"type": "Work Experience",
		"image": "/images/math4me.png"
	},
	{
		"name": "Personal Portfolio",
		"description": "I worked on and updated the front-end aspects of this project for professional functionality while practicing efficient quality assurance for 3+ years.\n - \nLanguages and Tools used: React.js, TypeScript, Next.js, Tailwind CSS, GitHub",
		"start_date": "September 2020",
		"end_date": "Present",
		"type": "Projects",
		"image": "/images/portfolio.png"
	},
	{
		"name": "2023 Toyota Innovation Challenge",
		"description": "My team - which included 4 people including myself - placed first out of 40+ teams receiving the \"Most Unique Approach\" award in this challenge by Toyota Motor Manufacturing Canada. We used OpenCV to develop an image-processing AI to detect sticker placement over holes on metallic surfaces. The algorithm was optimized to obtain a 99% success rate and run over live video feed achieving 30 fps.\n - \nLanguages & Tools used: Python, OpenCV, Google Colab",
		"start_date": "May 2023",
		"end_date": null,
		"type": ["Awards","Projects"],
		"image": "/images/tmmc.png"
	},
	{
		"name": "MIST (Muslim Interscholastic Tournament) Toronto Math Olympics",
		"description": "Achieved first place across all participating schools (in the Greater Toronto Area) in MIST Toronto's Math Olympics. This took almost 6 months of weekly exams and self-supervised tests as a practice to achieve.",
		"start_date": "May 2022",
		"end_date": null,
		"type": "Awards",
		"image": "/images/mist_math_olympics.png"
	},
	{
		"name": "International Math Tutor - Self Employed",
		"description": "I have been an entrepreneur for two years as I started my own tutoring business for international students - outside of Canada - and my own YouTube channel where I create more math videos to supplement my teaching.",
		"start_date": "September 2021",
		"end_date": "Present",
		"type": "Work Experience",
		"image": "/images/face.png"
	},
	{
		"name": "Ontario Scholar",
		"description": "Achieved a grade of 80% at least six times in Grade 12 courses and graduated with an impressive 97% average from John Fraser Secondary School.",
		"start_date": "June 2022",
		"end_date": null,
		"type": "Awards",
		"image": "/images/ontario_scholar.jpg"
	},
	{
		"name": "Senior Scholar at John Fraser Secondary School",
		"description": "I volunteered an hour of my time per week to help out peers and students in our school with specific subject materials that they were struggling with. I got the chance to feel charitable and master all the concepts I was helping with from all points of view - since I had to understand their questions using my logical thinking and connect them to common misinterpretations about each concept.",
		"start_date": "September 2021",
		"end_date": " June 2022",
		"type": "Volunteer Experience",
		"image": "/images/johnfraser_logo.png"
	},
	{
		"name": "University of Waterloo - Math Contests",
		"description": "Achieved top 25% out of all participants across the world in the following contests:\nPascal Contest (2018)\nCayley Contest (2019)\nFermat Contest (2020)\nCanadian Senior Mathematics Contest (2020)\nCanadian Senior Mathematics Contest (2021)",
		"start_date": "2018",
		"end_date": "2022",
		"type": "Awards",
		"image": "/images/uw_math_contests.png"
	},
	{
		"name": "Youth Peace Mural",
		"description": "The Youth Peace mural was a building-size project which took several months of work. I would be scheduled to help paint the mural for 5 hours per week alongside other people and newcomers. I gained experience creating ice-breakers and being socially aware since some newcomers could not speak English. I took it as my own responsibility to make sure that everyone had the best experience, no matter what obstacles they faced. It was my honour to be a part of this project since it stands for diversity and equality between all people with no discrimination!",
		"start_date": "September 2019",
		"end_date": "November 2019",
		"type": "Volunteer Experience",
		"image": "/images/peace_mural.png"
	},
	{
		"name": "Deforestation Prevention Foundation",
		"description": "A group of 2 people - including myself - built a friendly website to educate 270+ students in our high school on ways to reduce the effects of deforestation. We presented reliable statistics and facts to spread information about the issue.\n - \nLanguages and Tools used: HTML, CSS, JS",
		"start_date": "September 2020",
		"end_date": "January 2022",
		"type": "Projects",
		"image": "/images/tree.png"
	},
	{
		"name": "Event Organizer - Muslim Student Association (MSA)",
		"description": "I was part of the planners for major school-wide events. I learned about the responsibilities it takes for someone to run public events in an organized manner. We multitasked to make sure that there would be minimal littering involved while also enjoying our time since we had to create a sense of responsibility among participants.",
		"start_date": "September 2021",
		"end_date": "June 2022",
		"type": "Volunteer Experience",
		"image": "/images/jfss_msa.jpg"
	},
	{
		"name": "Scholten's Shell - Convenience Store",
		"description": "I was a floor worker and a substitute cashier at a convenience store in New Brunswick. Working here gave me the experience to know how people think and how much someone would be willing to spend on snacks.",
		"start_date": "June 2020",
		"end_date": "August 2020",
		"type": "Work Experience",
		"image": "/images/scholten.jpg"
	},
	{
		"name": "ASD-S Math Competition",
		"description": "Achieved first place with a team in a Mathematics Competition across all schools in the Anglophone South District - South (ASD-S) District at Saint John, New Brunswick.",
		"start_date": "November 2019",
		"end_date": null,
		"type": "Awards",
		"image": "/images/asds_winner.jpg"
	},
	{
		"name": "Third Shift Workshops",
		"description": "The third shift workshop was a painting project dedicated to the city of Saint John. The painting was established on the idea of building a new life/career after immigrating to a new city that supported it. Furthermore, since it was also a two-person project, I gained experience working in a less chaotic environment where communication was vital to ensure efficient success.",
		"start_date": "August 2019",
		"end_date": null,
		"type": "Volunteer Experience",
		"image": "/images/thirdshift.jpg"
	},
	{
		"name": "Mikey AED CPR",
		"description": "This is a course that I voluntarily took to learn about the procedures of performing CPR and other life-saving techniques which could be used if someone else ever needed it.",
		"start_date": "October 2020",
		"end_date": null,
		"type": "Volunteer Experience",
		"image": "/images/mikey_aid_cpr.png"
	},
	{
		"name": "Volunteer Book Organizer at Big Brothers Big sisters of Saint John",
		"description": "I was very fortunate to volunteer for Big Brothers Big Sisters of Saint John as we took the time to organize all the donated books. Our main goal was to ensure people could find what they wanted to read as that is a major factor when convincing others to read more and put in the effort.",
		"start_date": "August 2019",
		"end_date": null,
		"type": "Volunteer Experience",
		"image": "/images/bbbs.png"
	},
	{
		"name": "GreyHound Hounds Honors",
		"description": "I achieved GreyHound Hounds Honors with a 95% average at Saint John High School during the 2018-2019 school year. I was also enrolled in an IB program which made this award much harder to achieve.",
		"start_date": "June 2019",
		"end_date": null,
		"type": "Awards",
		"image": "/images/greyhound.jpg"
	},
	{
		"name": "Salvation Army Kettle Drive",
		"description": "The Salvation Army Kettle Drive is an organization that dedicates its efforts to donations. I - with a group of people - collected donations in an Atlantic Superstore during Christmas and presented candy canes as a gift for donors.",
		"start_date": "February 2018",
		"end_date": null,
		"type": "Volunteer Experience",
		"image": "/images/salvation_army.jpg"
	}
]
