[
	{
		"name": "Tuq Inc - Junior Developer",
		"description": "Worked on the back-end aspect of 6 client based projects using Rails and RubyMine.",
		"start_date": "January 2023",
		"end_date": "April 2023",
		"type": "Work Experience",
		"image": "tuq.png"
	},
	{
		"name": "MIST TORONTO Competitions Organizor",
		"description": "Helped recruit 50+ judges and moderators for the competitions to take place. I completed this with a team of 100+ members in 6 months.",
		"start_date": "September 2022",
		"end_date": "March 2023",
		"type": "Volunteer Experience",
		"image": "MIST_Toronto.png"
	},
	{
		"name": "Math4me - Mentor",
		"description": "Worked as a Math, Science, and English mentor to middle-school and high-school students who required assistance with those subjects. I achieved 'Mentor of the Month' at the time I started because of the hard work and dedication I had put into the job. After almost two years of working at Math4me, I have learned how to adapt and please different mindsets while convincing people - especially youth - to do what is right for them.",
		"start_date": "November 2020",
		"end_date": "Present",
		"type": "Work Experience",
		"image": "math4me.png"
	},
	{
		"name": "Ontario Scholar",
		"description": "Achieved a grade of 80% at least six times in Grade 12 courses.",
		"start_date": "June 2022",
		"end_date": null,
		"type": "Awards",
		"image": "ontario_scholar.jpg"
	},
	{
		"name": "MIST (Muslim Interscholastic Tournament) Toronto Math Olympics",
		"description": "Achieved first place across all participating schools (in the Greater Toronto Area) in MIST's Math Olympics.",
		"start_date": "May 2022",
		"end_date": null,
		"type": "Awards",
		"image": "Tuq.png"
	},
	{
		"name": "Senior Scholar at John Fraser Secondary School",
		"description": "I would be placed for an hour time slot every week to help out peers and students in our school with specific subject materials that they were struggling with. I got the chance to feel charitable and master all the concepts I was helping with from all points of view - since I had to understand their questions and use my logical thinking to connect them to common misinterpretations about each concept.",
		"start_date": "September 2021",
		"end_date": " June 2022",
		"type": "Volunteer Experience",
		"image": "johnfraser_logo.png"
	},
	{
		"name": "University of Waterloo - Math Contests",
		"description": "Achieved top 25% out of all participants across the world in the following contests: \nPascal Contest (2018)\nCayley Contest (2019)\nFermat Contest (2020)\nCanadian Senior Mathematics Contest (2020)\nCanadian Senior Mathematics Contest (2021)",
		"start_date": "2018",
		"end_date": "2022",
		"type": "Awards",
		"image": "Tuq.png"
	},
	{
		"name": "Muslim Student Association (MSA) Event Organizer",
		"description": "I was part of the planners of major school-wide events. I learned about the responsibilities it takes for someone to run public events in an organized manner. Since we were the people who had to clean after these events, we multitasked to make sure that there would be minimal littering involved while also enjoying our time.",
		"start_date": "September 2021",
		"end_date": "June 2022",
		"type": "Volunteer Experience",
		"image": "jfss_msa.jpg"
	},
	{
		"name": "Mikey AED CPR",
		"description": "A course that I voluntarily took to learn about the procedures of performing CPR and other life-saving techniques which could be used if someone else ever needed it.",
		"start_date": "October 2020",
		"end_date": null,
		"type": "Volunteer Experience",
		"image": "mikey_aid_cpr.png"
	},
	{
		"name": "Scholten's Shell - Convenience Store",
		"description": "A floor worker and substitute cashier at a convenience store in New Brunswick. Working here gave me the experience to know how people think, and what the average person wants.",
		"start_date": "June 2020",
		"end_date": "August 2020",
		"type": "Work Experience",
		"image": "scholten.jpg"
	},
	{
		"name": "ASD-S Math Competition",
		"description": "Achieved first place with a team in a Mathematics Competition across all schools in the Anglophone South District - South (ASD-S) District.",
		"start_date": "November 2019",
		"end_date": null,
		"type": "Awards",
		"image": "asds_winner.jpg"
	},
	{
		"name": "Youth Peace Mural - 10 St. James Street, Saint John, NB",
		"description": "The Youth Peace mural was a building-size project which took several months to complete. I would be scheduled to help paint the mural for 5 hours a week alongside other people and newcomers. I gained experience creating ice-breakers and being more socially aware since some newcomers could not speak English, so I took it as my own responsibility to make sure that everyone had the best experience, no matter what obstacles they faced. It was my honour to be a part of it since it stands for diversity and equality between all people with no discrimination!",
		"start_date": "September 2019",
		"end_date": "November 2019",
		"type": "Volunteer Experience"
	},
	{
		"name": "Third Shift Workshops",
		"description": "The third shift workshop was a painting project dedicated to the city of Saint John. The painting was established on the idea of building a new life/career after immigrating to a new city that supported it. Since it was also a two-person project, I gained experience working in a less chaotic environment where communication was vital to ensure efficient success.",
		"start_date": "August 2019",
		"end_date": null,
		"type": "Volunteer Experience",
		"image": "thirdshift.jpg"
	},
	{
		"name": "Volunteer Book Organizer at Big Brothers Big sisters of Saint John, NB",
		"description": "I was very fortunate to volunteer for Big Brothers Big Sisters of Saint John as we took the time to organize all the donated books. Our main goal was to ensure people could find what they wanted to read without having a hard time finding it, as that convinces them to read more.",
		"start_date": "August 2019",
		"end_date": null,
		"type": "Volunteer Experience",
		"image": "bbbs.png"
	},
	{
		"name": "GreyHound Hounds Honors",
		"description": "Achieved GreyHound Hounds Honors with a 95% average at Saint John High School during the 2018-2019 school year.",
		"start_date": "June 2019",
		"end_date": null,
		"type": "Awards",
		"image": "greyhound.jpg"
	},
	{
		"name": "Salvation Army Kettle Drive",
		"description": "The Salvation Army Kettle Drive is an organization that dedicates its efforts to donations. I - with a group of people - collected donations in an Atlantic Superstore during Christmas with candy canes as a gift for people who did donate.",
		"start_date": "February 2018",
		"end_date": null,
		"type": "Volunteer Experience",
		"image": "salvation_army.jpg"
	},
	{
		"name": "Gleaning",
		"description": "A group of people from the YMCA - which I was part of - went to a local farm, and gleaned carrots to donate to food banks in the City of Saint John.",
		"start_date": "Ocotober 2018",
		"end_date": null,
		"type": "Volunteer Experience",
		"image": "carrots.jpg"
	}
]
